In [22]:
import numpy as np
import pandas as pd

In [23]:
dataset_train = pd.read_csv("train.csv")
dataset_test = pd.read_csv("test.csv")

# New Section

In [24]:
dataset_train.info()
dataset_train.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
dataset_test.info()
dataset_test.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## **Createing the Train set and the Test set**

In [26]:
from sklearn.model_selection import train_test_split
X = dataset_train[['Pclass','Sex','Age','SibSp','Parch', 'Fare', 'Embarked']].copy()
y = dataset_train['Survived']
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 42)
X_submission = dataset_test[['Pclass','Sex','Age','SibSp','Parch', 'Fare', 'Embarked']].copy()
X_train.head()

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
331       1    male  45.5      0      0  28.5000        S
733       2    male  23.0      0      0  13.0000        S
382       3    male  32.0      0      0   7.9250        S
704       3    male  26.0      1      0   7.8542        S
813       3  female   6.0      4      2  31.2750        S

## **Data Preprocessing**

In [27]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()
le_embarked = LabelEncoder()
X_train['Sex'] = le_sex.fit_transform(X_train['Sex']) # male is 1 and female is 0
X_test['Sex'] = le_sex.transform(X_test['Sex'])
X_train['Embarked'] = le_embarked.fit_transform(X_train['Embarked'])
X_test['Embarked'] = le_embarked.transform(X_test['Embarked'])
X_submission['Sex'] = le_sex.transform(X_submission['Sex'])
X_submission['Embarked'] = le_embarked.transform(X_submission['Embarked'])
X_train

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
331       1    1  45.5      0      0   28.5000         2
733       2    1  23.0      0      0   13.0000         2
382       3    1  32.0      0      0    7.9250         2
704       3    1  26.0      1      0    7.8542         2
813       3    0   6.0      4      2   31.2750         2
..      ...  ...   ...    ...    ...       ...       ...
106       3    0  21.0      0      0    7.6500         2
270       1    1   NaN      0      0   31.0000         2
860       3    1  41.0      2      0   14.1083         2
435       1    0  14.0      1      2  120.0000         2
102       1    1  21.0      0      1   77.2875         2

[712 rows x 7 columns]

In [28]:
X_train

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
331       1    1  45.5      0      0   28.5000         2
733       2    1  23.0      0      0   13.0000         2
382       3    1  32.0      0      0    7.9250         2
704       3    1  26.0      1      0    7.8542         2
813       3    0   6.0      4      2   31.2750         2
..      ...  ...   ...    ...    ...       ...       ...
106       3    0  21.0      0      0    7.6500         2
270       1    1   NaN      0      0   31.0000         2
860       3    1  41.0      2      0   14.1083         2
435       1    0  14.0      1      2  120.0000         2
102       1    1  21.0      0      1   77.2875         2

[712 rows x 7 columns]

In [29]:
from sklearn.impute import KNNImputer
imputer = KNNImputer(n_neighbors=20)
X_train2 = X_train.copy()
X_test2 = X_test.copy()
X_submission2 = X_submission.copy()
types = X_train.dtypes.apply(lambda x: x.name).to_dict()
X_train = pd.DataFrame(imputer.fit_transform(X_train2), columns = X_train.columns)
X_test = pd.DataFrame(imputer.transform(X_test2), columns = X_test.columns)
X_submission = pd.DataFrame(imputer.transform(X_submission2), columns=X_submission.columns)
X_train = X_train.astype(types)
X_test = X_test.astype(types)
X_submission = X_submission.astype(types)
print(X_train[X_train['Age'].isnull()], X_test[X_test['Age'].isnull()])
print(X_train[X_train['Fare'].isnull()], X_test[X_test['Fare'].isnull()])

Empty DataFrame
Columns: [Pclass, Sex, Age, SibSp, Parch, Fare, Embarked]
Index: [] Empty DataFrame
Columns: [Pclass, Sex, Age, SibSp, Parch, Fare, Embarked]
Index: []
Empty DataFrame
Columns: [Pclass, Sex, Age, SibSp, Parch, Fare, Embarked]
Index: [] Empty DataFrame
Columns: [Pclass, Sex, Age, SibSp, Parch, Fare, Embarked]
Index: []

In [30]:
X_train

     Pclass  Sex   Age  SibSp  Parch      Fare  Embarked
0         1    1  45.5      0      0   28.5000         2
1         2    1  23.0      0      0   13.0000         2
2         3    1  32.0      0      0    7.9250         2
3         3    1  26.0      1      0    7.8542         2
4         3    0   6.0      4      2   31.2750         2
..      ...  ...   ...    ...    ...       ...       ...
707       3    0  21.0      0      0    7.6500         2
708       1    1  40.1      0      0   31.0000         2
709       3    1  41.0      2      0   14.1083         2
710       1    0  14.0      1      2  120.0000         2
711       1    1  21.0      0      1   77.2875         2

[712 rows x 7 columns]

In [31]:
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train[['Age','Fare']] = sc.fit_transform(X_train[['Age', 'Fare']])
X_test[['Age', 'Fare']] = sc.transform(X_test[['Age', 'Fare']])
X_submission[['Age', 'Fare']] = sc.transform(X_submission[['Age', 'Fare']])

In [32]:
X_train

     Pclass  Sex       Age  SibSp  Parch      Fare  Embarked
0         1    1  1.206120      0      0 -0.078684         2
1         2    1 -0.503913      0      0 -0.377145         2
2         3    1  0.180100      0      0 -0.474867         2
3         3    1 -0.275909      1      0 -0.476230         2
4         3    0 -1.795938      4      2 -0.025249         2
..      ...  ...       ...    ...    ...       ...       ...
707       3    0 -0.655916      0      0 -0.480162         2
708       1    1  0.795712      0      0 -0.030545         2
709       3    1  0.864113      2      0 -0.355804         2
710       1    0 -1.187926      1      2  1.683201         2
711       1    1 -0.655916      0      1  0.860748         2

[712 rows x 7 columns]

In [33]:
X_train.sample(10)

     Pclass  Sex       Age  SibSp  Parch      Fare  Embarked
252       1    1  1.209920      0      0 -0.126823         2
570       2    0 -0.807919      1      0 -0.126823         2
390       3    1 -0.807919      0      0 -0.472460         2
159       3    1  0.256102      0      0 -0.460666         0
407       3    1  0.268148      0      0 -0.348262         2
28        1    1  0.484106      1      2  1.683201         2
194       2    1  0.180100      1      0 -0.126823         2
351       1    1  1.092117      2      0  1.105534         1
447       1    0 -2.099943      1      2  2.290714         2
5         1    1 -0.427911      0      1  4.138687         0

In [34]:
X_test.sample(10)

     Pclass  Sex       Age  SibSp  Parch      Fare  Embarked
158       2    0  0.484106      1      0 -0.126823         2
138       3    1  0.940115      0      0 -0.482088         2
9         1    0 -0.807919      0      2 -0.121367         2
50        3    0 -1.871939      2      1 -0.256638         0
133       3    0 -1.871939      0      0 -0.387254         2
79        3    0  0.864113      0      2 -0.238264         2
20        3    1 -0.427911      0      0 -0.475429         2
86        1    0  0.104099      1      0  1.553707         0
83        3    1  0.077498      0      0 -0.478477         1
102       1    0 -0.807919      1      0  1.126315         0

# **Support Vector Machine Model**

In [35]:
from sklearn.svm import SVC
sv_classifier = SVC(kernel='linear')

In [36]:
from sklearn.metrics import confusion_matrix, classification_report
from sklearn.model_selection import cross_validate
from sklearn import metrics

scoring = ['accuracy', 'precision_macro', 'recall_macro', 'f1_macro']

scores = cross_validate(sv_classifier, X_train, y_train, scoring=scoring)
sv_classifier.fit(X_train, y_train)
y_predicted_test_sv = sv_classifier.predict(X_test)

print("accuracy: {0:0.2f}\n\
precision macro average: {1:0.2f}\n\
recall macro average: {2:0.2f}\n\
f1_score macro average: {3:0.2f}".format(
                                  scores['test_accuracy'].mean(), 
                                  scores['test_precision_macro'].mean(),
                                  scores['test_recall_macro'].mean(),
                                  scores['test_f1_macro'].mean()))
print(30*"-")
print(confusion_matrix(y_test, y_predicted_test_sv))
print(classification_report(y_test, y_predicted_test_sv))

accuracy: 0.79
precision macro average: 0.78
recall macro average: 0.76
f1_score macro average: 0.77
------------------------------
[[88 17]
 [22 52]]
              precision    recall  f1-score   support

           0       0.80      0.84      0.82       105
           1       0.75      0.70      0.73        74

    accuracy                           0.78       179
   macro avg       0.78      0.77      0.77       179
weighted avg       0.78      0.78      0.78       179

# **Logistic Regression Model**

In [37]:
from sklearn.linear_model import LogisticRegression
lr_classifier = LogisticRegression(random_state = 0)

In [38]:
scores = cross_validate(lr_classifier, X_train, y_train, scoring=scoring)
lr_classifier.fit(X_train, y_train)
y_predicted_test_lr = lr_classifier.predict(X_test)

print("accuracy: {0:0.2f}\n\
precision macro average: {1:0.2f}\n\
recall macro average: {2:0.2f}\n\
f1_score macro average: {3:0.2f}".format(
                                  scores['test_accuracy'].mean(), 
                                  scores['test_precision_macro'].mean(),
                                  scores['test_recall_macro'].mean(),
                                  scores['test_f1_macro'].mean()))
print(30*"-")
print(confusion_matrix(y_test, y_predicted_test_lr))
print(classification_report(y_test, y_predicted_test_lr))

accuracy: 0.80
precision macro average: 0.79
recall macro average: 0.77
f1_score macro average: 0.78
------------------------------
[[91 14]
 [19 55]]
              precision    recall  f1-score   support

           0       0.83      0.87      0.85       105
           1       0.80      0.74      0.77        74

    accuracy                           0.82       179
   macro avg       0.81      0.80      0.81       179
weighted avg       0.81      0.82      0.81       179

# **Guassian Naive Bayes Model**

In [39]:
from sklearn.naive_bayes import GaussianNB
gnb_classifier = GaussianNB()

In [40]:
scores = cross_validate(gnb_classifier, X_train, y_train, scoring=scoring)
gnb_classifier.fit(X_train, y_train)
y_predicted_test_gnb = gnb_classifier.predict(X_test)

print("accuracy: {0:0.2f}\n\
precision macro average: {1:0.2f}\n\
recall macro average: {2:0.2f}\n\
f1_score macro average: {3:0.2f}".format(
                                  scores['test_accuracy'].mean(), 
                                  scores['test_precision_macro'].mean(),
                                  scores['test_recall_macro'].mean(),
                                  scores['test_f1_macro'].mean()))
print(30*"-")
print(confusion_matrix(y_test, y_predicted_test_gnb))
print(classification_report(y_test, y_predicted_test_gnb))

accuracy: 0.79
precision macro average: 0.78
recall macro average: 0.78
f1_score macro average: 0.78
------------------------------
[[82 23]
 [17 57]]
              precision    recall  f1-score   support

           0       0.83      0.78      0.80       105
           1       0.71      0.77      0.74        74

    accuracy                           0.78       179
   macro avg       0.77      0.78      0.77       179
weighted avg       0.78      0.78      0.78       179

# **Predicting the Test Set**

In [41]:
y_predicted_sv = sv_classifier.predict(X_submission)
y_predicted_lr = lr_classifier.predict(X_submission)
y_predicted_gnb = gnb_classifier.predict(X_submission)

In [42]:
# write on gender_submission.csv
size = dataset_test['PassengerId'].values.size
predicted_array = np.concatenate((dataset_test['PassengerId'].values.reshape((size,1)), y_predicted_sv.reshape((size,1)), y_predicted_lr.reshape((size,1)), y_predicted_gnb.reshape((size,1))), axis=1)
predicted_df = pd.DataFrame(predicted_array, columns=["PassengerId", "Survived_SVM", "Survived_LR","Survived_GNB"])
predicted_df.to_csv("gender_submission.csv", index=False)